loadtest/results/2026-08-13/p1_guest_vu200_run3.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: feed-guest-step.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 200 looping VUs for 2m0s (gracefulStop: 30s)


running (0m00.9s), 200/200 VUs, 153 complete and 0 interrupted iterations
default   [   1% ] 200 VUs  0m00.9s/2m0s

running (0m01.9s), 200/200 VUs, 347 complete and 0 interrupted iterations
default   [   2% ] 200 VUs  0m01.9s/2m0s

running (0m02.9s), 200/200 VUs, 541 complete and 0 interrupted iterations
default   [   2% ] 200 VUs  0m02.9s/2m0s

running (0m03.9s), 200/200 VUs, 728 complete and 0 interrupted iterations
default   [   3% ] 200 VUs  0m03.9s/2m0s

running (0m04.9s), 200/200 VUs, 923 complete and 0 interrupted iterations
default   [   4% ] 200 VUs  0m04.9s/2m0s

running (0m05.9s), 200/200 VUs, 1121 complete and 0 interrupted iterations
default   [   5% ] 200 VUs  0m05.9s/2m0s

running (0m06.9s), 200/200 VUs, 1318 complete and 0 interrupted iterations
default   [   6% ] 200 VUs  0m06.9s/2m0s

running (0m07.9s), 200/200 VUs, 1515 complete and 0 interrupted iterations
default   [   7% ] 200 VUs  0m07.9s/2m0s

running (0m08.9s), 200/200 VUs, 1703 complete and 0 interrupted iterations
default   [   7% ] 200 VUs  0m08.9s/2m0s

running (0m09.9s), 200/200 VUs, 1902 complete and 0 interrupted iterations
default   [   8% ] 200 VUs  0m09.9s/2m0s

running (0m10.9s), 200/200 VUs, 2100 complete and 0 interrupted iterations
default   [   9% ] 200 VUs  0m10.9s/2m0s

running (0m11.9s), 200/200 VUs, 2290 complete and 0 interrupted iterations
default   [  10% ] 200 VUs  0m11.9s/2m0s

running (0m12.9s), 200/200 VUs, 2487 complete and 0 interrupted iterations
default   [  11% ] 200 VUs  0m12.9s/2m0s

running (0m13.9s), 200/200 VUs, 2674 complete and 0 interrupted iterations
default   [  12% ] 200 VUs  0m13.9s/2m0s

running (0m14.9s), 200/200 VUs, 2867 complete and 0 interrupted iterations
default   [  12% ] 200 VUs  0m14.9s/2m0s

running (0m15.9s), 200/200 VUs, 3063 complete and 0 interrupted iterations
default   [  13% ] 200 VUs  0m15.9s/2m0s

running (0m16.9s), 200/200 VUs, 3259 complete and 0 interrupted iterations
default   [  14% ] 200 VUs  0m16.9s/2m0s

running (0m17.9s), 200/200 VUs, 3457 complete and 0 interrupted iterations
default   [  15% ] 200 VUs  0m17.9s/2m0s

running (0m18.9s), 200/200 VUs, 3650 complete and 0 interrupted iterations
default   [  16% ] 200 VUs  0m18.9s/2m0s

running (0m19.9s), 200/200 VUs, 3850 complete and 0 interrupted iterations
default   [  17% ] 200 VUs  0m19.9s/2m0s

running (0m20.9s), 200/200 VUs, 4051 complete and 0 interrupted iterations
default   [  17% ] 200 VUs  0m20.9s/2m0s

running (0m21.9s), 200/200 VUs, 4251 complete and 0 interrupted iterations
default   [  18% ] 200 VUs  0m21.9s/2m0s

running (0m22.9s), 200/200 VUs, 4451 complete and 0 interrupted iterations
default   [  19% ] 200 VUs  0m22.9s/2m0s

running (0m23.9s), 200/200 VUs, 4646 complete and 0 interrupted iterations
default   [  20% ] 200 VUs  0m23.9s/2m0s

running (0m24.9s), 200/200 VUs, 4847 complete and 0 interrupted iterations
default   [  21% ] 200 VUs  0m24.9s/2m0s

running (0m25.9s), 200/200 VUs, 5040 complete and 0 interrupted iterations
default   [  22% ] 200 VUs  0m25.9s/2m0s

running (0m26.9s), 200/200 VUs, 5238 complete and 0 interrupted iterations
default   [  22% ] 200 VUs  0m26.9s/2m0s

running (0m27.9s), 200/200 VUs, 5439 complete and 0 interrupted iterations
default   [  23% ] 200 VUs  0m27.9s/2m0s

running (0m28.9s), 200/200 VUs, 5641 complete and 0 interrupted iterations
default   [  24% ] 200 VUs  0m28.9s/2m0s

running (0m29.9s), 200/200 VUs, 5835 complete and 0 interrupted iterations
default   [  25% ] 200 VUs  0m29.9s/2m0s

running (0m30.9s), 200/200 VUs, 6034 complete and 0 interrupted iterations
default   [  26% ] 200 VUs  0m30.9s/2m0s

running (0m31.9s), 200/200 VUs, 6238 complete and 0 interrupted iterations
default   [  27% ] 200 VUs  0m31.9s/2m0s

running (0m32.9s), 200/200 VUs, 6435 complete and 0 interrupted iterations
default   [  27% ] 200 VUs  0m32.9s/2m0s

running (0m33.9s), 200/200 VUs, 6631 complete and 0 interrupted iterations
default   [  28% ] 200 VUs  0m33.9s/2m0s

running (0m34.9s), 200/200 VUs, 6825 complete and 0 interrupted iterations
default   [  29% ] 200 VUs  0m34.9s/2m0s

running (0m35.9s), 200/200 VUs, 7025 complete and 0 interrupted iterations
default   [  30% ] 200 VUs  0m35.9s/2m0s

running (0m36.9s), 200/200 VUs, 7224 complete and 0 interrupted iterations
default   [  31% ] 200 VUs  0m36.9s/2m0s

running (0m37.9s), 200/200 VUs, 7428 complete and 0 interrupted iterations
default   [  32% ] 200 VUs  0m37.9s/2m0s

running (0m38.9s), 200/200 VUs, 7631 complete and 0 interrupted iterations
default   [  32% ] 200 VUs  0m38.9s/2m0s

running (0m39.9s), 200/200 VUs, 7824 complete and 0 interrupted iterations
default   [  33% ] 200 VUs  0m39.9s/2m0s

running (0m40.9s), 200/200 VUs, 8024 complete and 0 interrupted iterations
default   [  34% ] 200 VUs  0m40.9s/2m0s

running (0m41.9s), 200/200 VUs, 8228 complete and 0 interrupted iterations
default   [  35% ] 200 VUs  0m41.9s/2m0s

running (0m42.9s), 200/200 VUs, 8427 complete and 0 interrupted iterations
default   [  36% ] 200 VUs  0m42.9s/2m0s

running (0m43.9s), 200/200 VUs, 8627 complete and 0 interrupted iterations
default   [  37% ] 200 VUs  0m43.9s/2m0s

running (0m44.9s), 200/200 VUs, 8830 complete and 0 interrupted iterations
default   [  37% ] 200 VUs  0m44.9s/2m0s

running (0m45.9s), 200/200 VUs, 9027 complete and 0 interrupted iterations
default   [  38% ] 200 VUs  0m45.9s/2m0s

running (0m46.9s), 200/200 VUs, 9226 complete and 0 interrupted iterations
default   [  39% ] 200 VUs  0m46.9s/2m0s

running (0m47.9s), 200/200 VUs, 9428 complete and 0 interrupted iterations
default   [  40% ] 200 VUs  0m47.9s/2m0s

running (0m48.9s), 200/200 VUs, 9629 complete and 0 interrupted iterations
default   [  41% ] 200 VUs  0m48.9s/2m0s

running (0m49.9s), 200/200 VUs, 9830 complete and 0 interrupted iterations
default   [  42% ] 200 VUs  0m49.9s/2m0s

running (0m50.9s), 200/200 VUs, 10025 complete and 0 interrupted iterations
default   [  42% ] 200 VUs  0m50.9s/2m0s

running (0m51.9s), 200/200 VUs, 10231 complete and 0 interrupted iterations
default   [  43% ] 200 VUs  0m51.9s/2m0s

running (0m52.9s), 200/200 VUs, 10429 complete and 0 interrupted iterations
default   [  44% ] 200 VUs  0m52.9s/2m0s

running (0m53.9s), 200/200 VUs, 10628 complete and 0 interrupted iterations
default   [  45% ] 200 VUs  0m53.9s/2m0s

running (0m54.9s), 200/200 VUs, 10830 complete and 0 interrupted iterations
default   [  46% ] 200 VUs  0m54.9s/2m0s

running (0m55.9s), 200/200 VUs, 11027 complete and 0 interrupted iterations
default   [  47% ] 200 VUs  0m55.9s/2m0s

running (0m56.9s), 200/200 VUs, 11228 complete and 0 interrupted iterations
default   [  47% ] 200 VUs  0m56.9s/2m0s

running (0m57.9s), 200/200 VUs, 11431 complete and 0 interrupted iterations
default   [  48% ] 200 VUs  0m57.9s/2m0s

running (0m58.9s), 200/200 VUs, 11636 complete and 0 interrupted iterations
default   [  49% ] 200 VUs  0m58.9s/2m0s

running (0m59.9s), 200/200 VUs, 11838 complete and 0 interrupted iterations
default   [  50% ] 200 VUs  0m59.9s/2m0s

running (1m00.9s), 200/200 VUs, 12033 complete and 0 interrupted iterations
default   [  51% ] 200 VUs  1m00.9s/2m0s

running (1m01.9s), 200/200 VUs, 12234 complete and 0 interrupted iterations
default   [  52% ] 200 VUs  1m01.9s/2m0s

running (1m02.9s), 200/200 VUs, 12437 complete and 0 interrupted iterations
default   [  52% ] 200 VUs  1m02.9s/2m0s

running (1m03.9s), 200/200 VUs, 12638 complete and 0 interrupted iterations
default   [  53% ] 200 VUs  1m03.9s/2m0s

running (1m04.9s), 200/200 VUs, 12839 complete and 0 interrupted iterations
default   [  54% ] 200 VUs  1m04.9s/2m0s

running (1m05.9s), 200/200 VUs, 13039 complete and 0 interrupted iterations
default   [  55% ] 200 VUs  1m05.9s/2m0s

running (1m06.9s), 200/200 VUs, 13242 complete and 0 interrupted iterations
default   [  56% ] 200 VUs  1m06.9s/2m0s

running (1m07.9s), 200/200 VUs, 13441 complete and 0 interrupted iterations
default   [  57% ] 200 VUs  1m07.9s/2m0s

running (1m08.9s), 200/200 VUs, 13641 complete and 0 interrupted iterations
default   [  57% ] 200 VUs  1m08.9s/2m0s

running (1m09.9s), 200/200 VUs, 13845 complete and 0 interrupted iterations
default   [  58% ] 200 VUs  1m09.9s/2m0s

running (1m10.9s), 200/200 VUs, 14040 complete and 0 interrupted iterations
default   [  59% ] 200 VUs  1m10.9s/2m0s

running (1m11.9s), 200/200 VUs, 14241 complete and 0 interrupted iterations
default   [  60% ] 200 VUs  1m11.9s/2m0s

running (1m12.9s), 200/200 VUs, 14446 complete and 0 interrupted iterations
default   [  61% ] 200 VUs  1m12.9s/2m0s

running (1m13.9s), 200/200 VUs, 14648 complete and 0 interrupted iterations
default   [  62% ] 200 VUs  1m13.9s/2m0s

running (1m14.9s), 200/200 VUs, 14848 complete and 0 interrupted iterations
default   [  62% ] 200 VUs  1m14.9s/2m0s

running (1m15.9s), 200/200 VUs, 15052 complete and 0 interrupted iterations
default   [  63% ] 200 VUs  1m15.9s/2m0s

running (1m16.9s), 200/200 VUs, 15244 complete and 0 interrupted iterations
default   [  64% ] 200 VUs  1m16.9s/2m0s

running (1m17.9s), 200/200 VUs, 15448 complete and 0 interrupted iterations
default   [  65% ] 200 VUs  1m17.9s/2m0s

running (1m18.9s), 200/200 VUs, 15649 complete and 0 interrupted iterations
default   [  66% ] 200 VUs  1m18.9s/2m0s

running (1m19.9s), 200/200 VUs, 15851 complete and 0 interrupted iterations
default   [  67% ] 200 VUs  1m19.9s/2m0s

running (1m20.9s), 200/200 VUs, 16053 complete and 0 interrupted iterations
default   [  67% ] 200 VUs  1m20.9s/2m0s

running (1m21.9s), 200/200 VUs, 16250 complete and 0 interrupted iterations
default   [  68% ] 200 VUs  1m21.9s/2m0s

running (1m22.9s), 200/200 VUs, 16451 complete and 0 interrupted iterations
default   [  69% ] 200 VUs  1m22.9s/2m0s

running (1m23.9s), 200/200 VUs, 16650 complete and 0 interrupted iterations
default   [  70% ] 200 VUs  1m23.9s/2m0s

running (1m24.9s), 200/200 VUs, 16856 complete and 0 interrupted iterations
default   [  71% ] 200 VUs  1m24.9s/2m0s

running (1m25.9s), 200/200 VUs, 17057 complete and 0 interrupted iterations
default   [  72% ] 200 VUs  1m25.9s/2m0s

running (1m26.9s), 200/200 VUs, 17253 complete and 0 interrupted iterations
default   [  72% ] 200 VUs  1m26.9s/2m0s

running (1m27.9s), 200/200 VUs, 17448 complete and 0 interrupted iterations
default   [  73% ] 200 VUs  1m27.9s/2m0s

running (1m28.9s), 200/200 VUs, 17648 complete and 0 interrupted iterations
default   [  74% ] 200 VUs  1m28.9s/2m0s

running (1m29.9s), 200/200 VUs, 17849 complete and 0 interrupted iterations
default   [  75% ] 200 VUs  1m29.9s/2m0s

running (1m30.9s), 200/200 VUs, 18048 complete and 0 interrupted iterations
default   [  76% ] 200 VUs  1m30.9s/2m0s

running (1m31.9s), 200/200 VUs, 18244 complete and 0 interrupted iterations
default   [  77% ] 200 VUs  1m31.9s/2m0s

running (1m32.9s), 200/200 VUs, 18445 complete and 0 interrupted iterations
default   [  77% ] 200 VUs  1m32.9s/2m0s

running (1m33.9s), 200/200 VUs, 18647 complete and 0 interrupted iterations
default   [  78% ] 200 VUs  1m33.9s/2m0s

running (1m34.9s), 200/200 VUs, 18846 complete and 0 interrupted iterations
default   [  79% ] 200 VUs  1m34.9s/2m0s

running (1m35.9s), 200/200 VUs, 19049 complete and 0 interrupted iterations
default   [  80% ] 200 VUs  1m35.9s/2m0s

running (1m36.9s), 200/200 VUs, 19252 complete and 0 interrupted iterations
default   [  81% ] 200 VUs  1m36.9s/2m0s

running (1m37.9s), 200/200 VUs, 19447 complete and 0 interrupted iterations
default   [  82% ] 200 VUs  1m37.9s/2m0s

running (1m38.9s), 200/200 VUs, 19646 complete and 0 interrupted iterations
default   [  82% ] 200 VUs  1m38.9s/2m0s

running (1m39.9s), 200/200 VUs, 19852 complete and 0 interrupted iterations
default   [  83% ] 200 VUs  1m39.9s/2m0s

running (1m40.9s), 200/200 VUs, 20051 complete and 0 interrupted iterations
default   [  84% ] 200 VUs  1m40.9s/2m0s

running (1m41.9s), 200/200 VUs, 20249 complete and 0 interrupted iterations
default   [  85% ] 200 VUs  1m41.9s/2m0s

running (1m42.9s), 200/200 VUs, 20445 complete and 0 interrupted iterations
default   [  86% ] 200 VUs  1m42.9s/2m0s

running (1m43.9s), 200/200 VUs, 20649 complete and 0 interrupted iterations
default   [  87% ] 200 VUs  1m43.9s/2m0s

running (1m44.9s), 200/200 VUs, 20851 complete and 0 interrupted iterations
default   [  87% ] 200 VUs  1m44.9s/2m0s

running (1m45.9s), 200/200 VUs, 21051 complete and 0 interrupted iterations
default   [  88% ] 200 VUs  1m45.9s/2m0s

running (1m46.9s), 200/200 VUs, 21256 complete and 0 interrupted iterations
default   [  89% ] 200 VUs  1m46.9s/2m0s

running (1m47.9s), 200/200 VUs, 21450 complete and 0 interrupted iterations
default   [  90% ] 200 VUs  1m47.9s/2m0s

running (1m48.9s), 200/200 VUs, 21655 complete and 0 interrupted iterations
default   [  91% ] 200 VUs  1m48.9s/2m0s

running (1m49.9s), 200/200 VUs, 21855 complete and 0 interrupted iterations
default   [  92% ] 200 VUs  1m49.9s/2m0s

running (1m50.9s), 200/200 VUs, 22057 complete and 0 interrupted iterations
default   [  92% ] 200 VUs  1m50.9s/2m0s

running (1m51.9s), 200/200 VUs, 22257 complete and 0 interrupted iterations
default   [  93% ] 200 VUs  1m51.9s/2m0s

running (1m52.9s), 200/200 VUs, 22452 complete and 0 interrupted iterations
default   [  94% ] 200 VUs  1m52.9s/2m0s

running (1m53.9s), 200/200 VUs, 22654 complete and 0 interrupted iterations
default   [  95% ] 200 VUs  1m53.9s/2m0s

running (1m54.9s), 200/200 VUs, 22847 complete and 0 interrupted iterations
default   [  96% ] 200 VUs  1m54.9s/2m0s

running (1m55.9s), 200/200 VUs, 23048 complete and 0 interrupted iterations
default   [  97% ] 200 VUs  1m55.9s/2m0s

running (1m56.9s), 200/200 VUs, 23249 complete and 0 interrupted iterations
default   [  97% ] 200 VUs  1m56.9s/2m0s

running (1m57.9s), 200/200 VUs, 23448 complete and 0 interrupted iterations
default   [  98% ] 200 VUs  1m57.9s/2m0s

running (1m58.9s), 200/200 VUs, 23645 complete and 0 interrupted iterations
default   [  99% ] 200 VUs  1m58.9s/2m0s

running (1m59.9s), 200/200 VUs, 23844 complete and 0 interrupted iterations
default   [ 100% ] 200 VUs  1m59.9s/2m0s

running (2m00.9s), 015/200 VUs, 24056 complete and 0 interrupted iterations
default ↓ [ 100% ] 200 VUs  2m0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 48142   398.105641/s
    checks_succeeded...: 100.00% 48142 out of 48142
    checks_failed......: 0.00%   0 out of 48142

    ✓ status 200
    ✓ 본문 있음

    CUSTOM
    feed_guest_duration............: avg=1s min=20.17ms med=1s p(90)=1.04s p(95)=1.89s p(99)=1.97s max=3.74s

    HTTP
    http_req_duration..............: avg=1s min=20.17ms med=1s p(90)=1.04s p(95)=1.89s p(99)=1.97s max=3.74s
      { expected_response:true }...: avg=1s min=20.17ms med=1s p(90)=1.04s p(95)=1.89s p(99)=1.97s max=3.74s
    http_req_failed................: 0.00%  0 out of 24071
    http_reqs......................: 24071  199.05282/s

    EXECUTION
    iteration_duration.............: avg=1s min=21.31ms med=1s p(90)=1.04s p(95)=1.89s p(99)=1.97s max=3.74s
    iterations.....................: 24071  199.05282/s
    vus............................: 15     min=15         max=200
    vus_max........................: 200    min=200        max=200

    NETWORK
    data_received..................: 348 MB 2.9 MB/s
    data_sent......................: 1.9 MB 16 kB/s



running (2m00.9s), 000/200 VUs, 24071 complete and 0 interrupted iterations
default ✓ [ 100% ] 200 VUs  2m0s